export const CONFIG = {
    width: 320,
    height: 250,
    ticks: 7,
    grid: {
        top: 10,
        bottom: 10,
        left: 10,
        right: 10,
    },
    xAxis: {   
        data: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],  
    },
    yAxis: [
	    {
            name: '水量',
            
		},
		{
			name: '温度',
		}
    ],
    series: {
        bar: [
            {
                name: '蒸发量',
                data: [2.0, 4.9, 7.0, 23.2, 25.6, 7.7, 135.6, 162.2, 32.6, 20.0, 6.4, 3.3]
            },
            {
                name: '降水量',
                data: [2.6, 5.9, 9.0, 26.4, 28.7, 70.7, 175.6, 182.2, 48.7, 18.8, 6.0, 2.3]
            },
        ],
        line: [
            {
                name: '平均温度',
                data: [2.0, 2.2, 3.3, 4.5, 6.3, 10.2, 20.3, 23.4, 23.0, 16.5, 12.0, 6.2]
            }
        ]
    }

}